shulinbao/ai-passport-radio/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。所有缓冲都要按"内部 RAM"算。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头,关闭 detect,便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app;用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 中文字形由 assets/fonts/radio_font_cjk_16.c / _20.c 提供(见 tools/gen_fonts.py)。
# 这两个子集不含 LV_SYMBOL_* 图标,所以 Montserrat 仍需保留并作为 fallback。
CONFIG_LV_TXT_ENC_UTF8=y
# 缺字形时画出占位框而不是留白:开发期宁可看见方框,也不要"看起来正常但少字"。
CONFIG_LV_USE_FONT_PLACEHOLDER=y
# 中文字体覆盖整块 CJK 基本区(22k+ 字形),字形偏移超出 16 位可寻址范围。
# 不开这个选项,LVGL 生成的字体会在编译期直接用 #error 拦下来:
#   "Too large font or glyphs ... Enable LV_FONT_FMT_TXT_LARGE in lv_conf.h"
# 打开后字形描述符改用 32 位偏移,代价是每个字形多几个字节的 Flash。
CONFIG_LV_FONT_FMT_TXT_LARGE=y
# LVGL 自己的日志:分配失败(LVGL 内存池耗尽)在默认配置下是静默的,
# 表现成"白屏 + 重启"而无任何线索。打开 WARN 级别后至少能看到一行明确原因。
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
# LVGL 内置 malloc 池。它是独立静态区、不与系统堆共享。
# 实测数据(真机日志):基础界面用 19.3KB,打开软键盘再 +17.9KB。早先逐对象设
# 样式属性,池子被吃到只剩 4.8KB 最大空闲块、碎片 31%,随后一次分配失败直接
# Load access fault(A0=0)+ 栈写坏 → 白屏。
# 现在改成共享样式(见 radio_styles.h),占用大幅下降;池子同时放大到 64KB 留足余量。
# 注意:LVGL 9.5 起 LV_MEM_SIZE_KILOBYTES 已废弃,新的 LV_MEM_SIZE 以【字节】为单位。
#
# ⚠ 后来又缩回 48KB,原因是 AAC 解码器要内存(真机日志,别改回去之前先看这段):
#   马来西亚 Astro 系(Mix FM / Lite FM ...)只有 AAC 源,解码器一次性要 55.8KB
#   连续堆(官方文档 51.2KB + 解析器开销),而这块池子是【静态 .bss】——它占的
#   RAM 不会进系统堆。64KB 池时系统堆只剩 72.5KB,解码器一吃就只剩 16.7KB,
#   连 12KB 的流缓冲都拿不出来(真机现象:"显存 out of memory")。
#   缩到 48KB 等于把 16KB 还回系统堆。界面本身峰值约 36KB(基础 20KB + 软键盘
#   16KB),48KB 仍有余量 —— 但改动这里必须上机确认软键盘还能正常弹出。
CONFIG_LV_MEM_SIZE=49152

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# app_main 里做的初始化较多(显示、LVGL、NVS、Wi-Fi、播放器、界面),默认 3.5KB 偏紧。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=5120

# --- 蓝牙 ---
# 本应用不需要 BLE(配网走设备端软键盘 + Wi-Fi STA),关掉可以省下约 100KB Flash
# 与可观的内部 RAM,留给音频解码和网络缓冲。
# CONFIG_BT_ENABLED is not set

# --- 音频解码(espressif/esp_audio_codec)---
# 只启用实际用到的两种:目录里 MP3(香港 RTHK、新加坡 Mediacorp、马来西亚 RTM)
# 与 AAC-ADTS(马来西亚 Astro:Mix FM / Lite FM / Hitz FM ...)。
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_AAC_SUPPORT=y
# CONFIG_AUDIO_DECODER_G711_SUPPORT is not set
# CONFIG_AUDIO_DECODER_AMRNB_SUPPORT is not set
# CONFIG_AUDIO_DECODER_AMRWB_SUPPORT is not set
# CONFIG_AUDIO_DECODER_FLAC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_OPUS_SUPPORT is not set
# CONFIG_AUDIO_DECODER_VORBIS_SUPPORT is not set
# CONFIG_AUDIO_DECODER_ADPCM_SUPPORT is not set
# CONFIG_AUDIO_DECODER_ALAC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_PCM_SUPPORT is not set
# CONFIG_AUDIO_DECODER_SBC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_LC3_SUPPORT is not set
# CONFIG_AUDIO_DECODER_G722_SUPPORT is not set
# CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT is not set
# CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT is not set
# CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT is not set
# CONFIG_AUDIO_SIMPLE_DEC_OGG_SUPPORT is not set

# --- TLS ---
# 目录里绝大多数流是 https,必须内置根证书;否则每个台都会以
# "无法建立连接" 失败,而且原因只在日志里可见。
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# TLS 记录缓冲默认 16KB/16KB,对"只收音频流、请求很短"的场景是浪费,
# 而这块板子没有 PSRAM。收 8KB / 发 4KB 足够,省下的内部 RAM 让给 LVGL 内存池。
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# --- Wi-Fi ---
# 音频流是持续下行,缓冲太少会在解码/刷屏的间隙丢包,表现为周期性卡顿。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
# BA(block ack)接收窗口:每个缓冲约 1.6KB 且【开机就分配】。6 -> 4 省下约 3KB
# 真实堆内存,代价只是聚合窗口小一点 —— 32~128kbps 的音频流完全用不到 6。
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5
